<?php
header("Content-Type: text/html; charset=utf-8");

/*
 * Выполнить примеры из методички, разобраться, как это работает.
 */

$name = "Alex";
echo "Hello, $name!"; // на место переменной подставляется ее значение

$a = "Hello"; // Строка
$b = true; // Булевое значение (true/false)
$c = 45; // Целочисленное число
$d = 4.2; // Число с плавающей точкой
echo $a;
echo $b; // true преобразуется к числу 1
echo $c;
echo $d;

$a = 'Hello';
$b = "world";
$c = "$a, $b"; // подставляются значения переменных
$d = '$a, $b'; // значения переменных не подставляются
echo $c;
echo $d;

$a = 'Hello,';
$b = 'world';
$c = $a . $b; // производится конкатенация, значения переменных подставляются
echo $c;

$a = (int)'05'; // преобразоввание к целому типу
$b = (string)145.3; // преобразоввание к строке
$c = (bool)-4; // преобразоввание к логическому типу
echo 'Строка -> число -> строка : ' . $a . '<br>'; // 5
echo 'Число -> строка : ' . $b . '<br>'; // 145.3
echo 'Число -> булев -> строка : ' . $c . '<br>'; // 1

$a = 4;
$b = 5;
echo $a + $b . '<br>'; // сложение
echo $a * $b . '<br>'; // умножение
echo $a - $b . '<br>'; // вычитание
echo $a / $b . '<br>'; // деление
echo $a % $b . '<br>'; // остаток от деления
// echo $a ** $b . '<br>'; // возведение в степень; оператор работает с
// версии 5.6

$a = 4;
$b = 5;
$a += $b; // a = a + b
echo 'a = ' . $a;

$a = 0;
echo $a++; // Постинкремент - 0
echo ++$a; // Преинкремент - 2
echo $a--; // Постдекремент - 2
echo --$a; // Предекремент - 0

$a = 4;
$b = 5;
var_dump($a == $b); // Сравнение с приведением типов - bool(false)
var_dump($a === $b); // Сравнение без приведения типов - bool(false)
var_dump($a > $b); // Больше - bool(false)
var_dump($a < $b); // Меньше - bool(true)
var_dump($a <> $b); // Не равно - bool(true)
var_dump($a != $b); // Не равно - bool(true)
var_dump($a !== $b); // Не равно без приведения типов - bool(true)
var_dump($a <= $b); // Меньше или равно - bool(true)
var_dump($a >= $b); // Больше или равно - bool(false)

$a = 4;
$b = '4';
var_dump($a == $b); // Сравнение с приведением типов - bool(true)
var_dump($a === $b); // Сравнение без приведения типов, число не равно стоке -
// bool(false)

define('MY_CONST', 100);
echo MY_CONST; // выводится значение константы 100

/**
 * Объясните, как работает данный код
 */
// --- //
$a = 5;
$b = '05';
var_dump($a == $b); // Почему true? - Для стравнения строка приводится к
// целому числу
// --- //
var_dump((int)'012345'); // Почему 12345? - При преобразовании к целому числу
// незначащие разряды отбрасываются
// --- //
var_dump((float)123.0 === (int)123.0); // Почему false? - Сравнение без
// приведения типов, float не равно int
// --- //
var_dump((int)0 === (int)'hello, world'); // Почему true? - Строка
// преобразуется к целому числу 0. Совпадают и типы, и значения


/**
 * Дополнительное задание
 * Используя только две переменные, поменяйте их значения местами.
 * Например, если a = 1, b = 2, надо, чтобы получилось: b = 1, a = 2.
 * Дополнительные переменные использовать нельзя.
 */
$a = 1;
$b = 2;

$a = $a + $b;
$b = $a - $b;
$a = $a - $b;

echo $a;
echo $b;
?>