<?php
/*
С помощью цикла do…while напишите функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
0 – это ноль
1 – нечетное число
2 – четное число
3 – нечетное число
…
10 – четное число
 */

$i = 0;

function oddEven($i)
{
    do {
        if ($i === 0) {
            echo '0 – это ноль', "\n";
        } elseif ($i % 2 !== 0) {
            echo $i . ' – нечетное число', "\n";
        } else {
            echo $i . ' – четное число', "\n";
        }
        $i++;
    } while ($i <= 10);
}

oddEven($i);