<?php
/* Объявите массив, где в качестве ключей будут использоваться названия областей,
а в качестве значений – массивы с названиями городов из соответствующей области.
Выведите в цикле значения массива, чтобы результат был таким:
Московская область:
Москва, Зеленоград, Клин
Ленинградская область:
Санкт-Петербург, Всеволожск, Павловск, Кронштадт
Рязанская область
…
 */

$areas = array('Московская область' => array('Москва', 'Зеленоград', 'Клин'),
    'Ленинградская область' => array('Санкт-Петербург', 'Всеволжск', 'Павловск', 'Кронштадт'),
    'Рязанская область' => array('Рязань', 'Шацк', 'Касимов'));

foreach ($areas as $area => $towns) {
    echo "$area:", "\n";
    foreach ($towns as $key => $town) {
        $str = "$town" . ',  ';
        echo $str;
    }
    echo "\n";
}
// Не получилось избавиться от крайних правых запятых в строках.